import nlpaug.augmenter.char as nac
import json
import os
import pandas as pd

df_ideal_address = pd.DataFrame(df_all_districts['united_addr'].sample(n=100, random_state=42).reset_index(drop=True))

# 2. применение nlpaug

# Карта смежных клавиш для стандартной раскладки ЙЦУКЕН
ru_keyboard_map = {
    'й': ['ц', 'ф', '1', '2'], 'ц': ['й', 'у', 'ф', 'ы', '2', '3'], 'у': ['ц', 'к', 'ы', 'в', '3', '4'],
    'к': ['у', 'е', 'в', 'а', '4', '5'], 'е': ['к', 'н', 'а', 'п', '5', '6'], 'н': ['е', 'г', 'п', 'р', '6', '7'],
    'г': ['н', 'ш', 'р', 'о', '7', '8'], 'ш': ['г', 'щ', 'о', 'л', '8', '9'], 'щ': ['ш', 'з', 'л', 'д', '9', '0'],
    'з': ['щ', 'х', 'д', 'ж', '0', '-'], 'х': ['з', 'ъ', 'ж', 'э', '-', '='], 'ъ': ['х', 'э', '='],
    'ф': ['й', 'ц', 'ы', 'я'], 'ы': ['ц', 'у', 'ф', 'в', 'я', 'ч'], 'в': ['у', 'к', 'ы', 'а', 'ч', 'с'],
    'а': ['к', 'е', 'в', 'п', 'с', 'м'], 'п': ['е', 'н', 'а', 'р', 'м', 'и'], 'р': ['н', 'г', 'п', 'о', 'и', 'т'],
    'о': ['г', 'ш', 'р', 'л', 'т', 'ь'], 'л': ['ш', 'щ', 'о', 'д', 'ь', 'б'], 'д': ['щ', 'з', 'л', 'ж', 'б', 'ю'],
    'ж': ['з', 'х', 'д', 'э', 'ю', '.'], 'э': ['х', 'ъ', 'ж', '.'],
    'я': ['ф', 'ы', 'ч'], 'ч': ['ы', 'в', 'я', 'с'], 'с': ['в', 'а', 'ч', 'м'], 'м': ['а', 'п', 'с', 'и'],
    'и': ['п', 'р', 'м', 'т'], 'т': ['р', 'о', 'и', 'ь'], 'ь': ['о', 'л', 'т', 'б'], 'б': ['л', 'д', 'ь', 'ю'],
    'ю': ['д', 'ж', 'б', '.']
}

# Сохраняем в JSON файл
with open('ru_keyboard.json', 'w', encoding='utf-8') as f:
    json.dump(ru_keyboard_map, f, ensure_ascii=False)

# --- Способ А: Имитация опечаток на клавиатуре (KeyboardAug) ---
# lang='ru' имитирует русскую раскладку (йцукен).
# Если нажать не ту кнопку, 'а' может замениться на 'п' или 'м'.
aug_keyboard = nac.KeyboardAug(
    model_path='ru_keyboard.json',
    aug_char_p=0.2,  # Вероятность изменения символа (20%)
    aug_word_p=0.1,  # Вероятность того, что слово будет затронуто (100% слов)
    # lang='ru'        # Русская раскладка - не поддерживается :(
)

# --- Способ Б: Вставка/Замена случайных символов (RandomCharAug) ---
# action='insert' добавляет лишние символы
# action='substitute' заменяет существующие
aug_random = nac.RandomCharAug(
    action="insert",
    aug_char_p=0.2,
    aug_word_p=0.1,
    spec_char='!@#%_123' # Можно задать свой набор символов для шума
)

# Применяем
# Обратите внимание: augment возвращает список, поэтому берем [0]
try:
    df_ideal_address['keyboard_noise'] = df_ideal_address['united_addr'].apply(lambda x: aug_keyboard.augment(x)[0])
    df_ideal_address['random_insert'] = df_ideal_address['united_addr'].apply(lambda x: aug_random.augment(x)[0])

    print(df_ideal_address)
except Exception as e:
    print(f"Ошибка: {e}")
