# Собираем города и районы - вручную, пока не найден более оптимальный способ
city_and_distr = pd.DataFrame(columns=['address'],
                              data=['Северное Тушино, Москва, Россия',
                                    'Южное Тушино, Москва, Россия',
                                    'Центральный район, Санкт-Петербург, Россия',
                                    'Октябрьский район, Новосибирск, Россия',
                                    'Верх-Исетский район, Екатеринбург, Россия',
                                    'Вахитовский район, Казань, Россия',
                                    'Свердловский район, Красноярск, Россия',
                                    'Нижегородский район, Нижний Новгород, Россия',
                                    'Центральный район, Челябинск, Россия',
                                    'Кировский район, Уфа, Россия',
                                    'Самарский район, Самара, Россия',
                                    'Ленинский район, Ростов-на-Дону, Россия',
                                    'Западный округ, Краснодар, Россия',
                                    'Октябрьский район, Омск, Россия',
                                    'Коминтерновский район, Воронеж, Россия'])

city_and_distr
